{"coachesJ":[
{"coachPic":"_images/coach00.png", 
 "coachName":"Karla Mohtashemi-Reese", 
 "coachCity":"Seattle",
 "coachStory":"<p>I am from Seattle Washington and have been a Diamond Coach for a little over a year.<\/p><p>I started Coaching because I wanted to try Shakeology. When I was first approached, I was pretty excited about the opportunity to help others. Then, when I was told it was a business opportunity, I told my Coach \"No, I don’t want to start a business.\" The real reason is that I believed I should not be paid to help others. I volunteer as a: Girl Scout Leader, Girl Scout PR rep, special councils for Girl Scout encampment experiences, Sunflower Children, Save Our Waves beach cleanups, Founder\/choreographer and director for the Aviation High School Ballroom dance Team, Thrill the World Instructor, Toy Fair (where we create toys for agency kids and teens), I have been the Block Watch captain, done the Buddy Walk,  donate my hair every two to three years to Locks of Love, and donate time to just about anything else I can squeeze pin. So, when Carl talks about people DESERVING to get aid to help others, I SWEAR he is talking directly to me.<\/p><p>Suddenly, one day, I realized how many people bought P90X because of my recommendations and success, that I thought I was being silly. Then, my Coach pointed out that I could get Shakeology at the discount, and I gave it a try. At first, with my busy schedule (in addition to volunteer work, I am an actress\/stunt person for Seattle Knights and Pirates of Puget Sound www.seattleknights.com) and the additional hours I was doing at work (60 hours because of a large project I was responsible for), I just enjoyed my Shakeology discount, and that was that. Eventually, people started reaching out to me for help with their programs and I told them about the Coaching opportunity (using the Decide video). I would have never met some of these people if it were not for Beachbody, and that ALONE makes me forever grateful for this opportunity! After going Emerald, I went to a Game Plan Event, and I saw the possibilities. I decided to reach for the stars, called my Coach and told her I wanted to do a Get Started Right Interview with her and I would be Diamond by Summit. I missed that mark by about a few weeks, but I DID GO Diamond. My first personal goal was and is still to get my family and friends healthy and fit! I consider all my customers friends, so they are priority one.<\/p><h3>HERE’S MY SUCCESS AND THEIRS!<\/h3><p>They are sticking to the programs, and kicking booty!! My lovely Coach, Jen went from size 16 to size 9 in less than a year! My lovely Coach Kimberly lost 12 inches overall! One of my best friends can nearly wrap his belt around his waist twice! Another customer, Kevin wrote a beautiful letter on his TBB bio page thanking me and talking about taking back his life and being a positive influence on his son! One of my best friends from High School told me she hit her goal weight a month ago! My Mom and Dad are working toward defeating Type 2 Diabetes with Project YOU AND Shakeology. My daughter doesn’t have to go under the knife because she has finally stretched her hamstrings and gastrocnemius enough to walk normally. Now she is so flexible that she is often mistaken for a contortionist! My Mother in law is off her high blood pressure meds, and my Father in law finally has normal cholesterol levels! The stories go on and on! The most poignant is that my husband, who was diagnosed with Renal Cell Carcinoma and had a tumor the size of a child’s bowling ball removed along with his kidney is completely cancer free! His surgeon said the best thing he ever did for himself was to get fit and healthy PRIOR to this diagnosis. The tumor could have been growing for over 5 years. His surgeon is a P90X and Insanity grad who drinks Shakeology by the way! We were in good hands! :)<\/p><p>My success is measured by the lives I can change for the better. I do have some personal goals as well. Other than my physical goals, I included some financial goals for my business.<\/p><p>My first financial Goal was to get Shakeology for free (via commission payment from Beachbody). Attained. My next biggest goal is to pay for my daughter’s college tuition. Because of Beachbody, I now have the first year’s tuition for her in the bank!!! I am THRILLED!<\/p><p>As far as my business “secrets”, I don’t think they are really secrets. CARE about others. TRULY WANT to help and you WILL step out of your shell to reach out to them. If you care about someone else more than you care about yourself, you won’t let those little voices in your head that are filled with fear of rejection control your actions.<\/p><p>EXAMPLE: If you care about your children, you punish them when they misbehave because you know it is what will help them grow, EVEN THOUGH they may be angry with you at the time. If I care about myself more, I would ignore their actions, because I want to always be loved.<\/p><p>If I care about OTHERS more, I will go ahead and take that risk to reach out to them.<\/p>",
 "coachStatement":"I'm Karla Reese and I'll End the Trend!", 
 "coachUse":"1"},

{"coachPic":"_images/coach01.png", 
 "coachName":"coachName 02", 
 "coachCity":"coachCity 02",
 "coachStory":"coachStory 02", 
 "coachStatement":"coachStatment 02", 
 "coachUse":"1"},

{"coachPic":"_images/coach02.png", 
 "coachName":"coachName 03", 
 "coachCity":"coachCity 03",
 "coachStory":"coachStory 03", 
 "coachStatement":"coachStatment03", 
 "coachUse":"1"},

{"coachPic":"_images/coach03.png", 
 "coachName":"coachName 04", 
 "coachCity":"coachCity 04",
 "coachStory":"coachStory 04", 
 "coachStatement":"coachStatment04", 
 "coachUse":"1"}
]}